In [36]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import os

from sqlalchemy import create_engine
from sqlalchemy import Column, Integer, String, Float
from sqlalchemy.orm import Session
from sqlalchemy.ext.declarative import declarative_base

os.environ['user'] = user
os.environ['password'] = password

# create database connection 
engine = create_engine(f"postgresql://{user}:{password}@localhost:5432/EmployeeSQL")
Base = declarative_base()
Base.metadata.create_all(engine)
conn = engine.connect()
session = Session(bind=engine)

In [54]:
# Read the "salaries" table
salary_data = pd.read_sql("select * from salaries", conn)

salary_data.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12

In [53]:
print(salary_data['salary'].min())
print(salary_data['salary'].max())

40000
129492

In [59]:
# # Arrange the salary ranges into groups

# salary_grouped = salary_data.groupby('salary')['emp_no'].count()

# # salaries = salary_grouped['emp_no'].count()


# salary_grouped.head()

salary
40000    95346
40001        5
40002       10
40003        9
40004        9
Name: emp_no, dtype: int64

In [79]:
salary_bin = [0, 39999, 49999, 59999, 69999, 79999, 89999, 99999, 199999, 119999, 129999]
salary_labels = ["< $40K", "$50K", "$60K", "$70K", "$80K", "$90K", "$100K", "$110K", "$120K", "$130K"]

pd.cut(salary_grouped.astype(float64), salary_bin, labels = salary_labels).head()

NameError: name 'float64' is not defined

In [ ]:
# Create a histogram to visualize the most common salary ranges for employees.

In [ ]:

salaries.plot(kind = 'hist')